-- made by { @barko_b}
do
ws = {}
rs = {}
-- some examples of how to use this :3 
ws[1] = "هلاو" 
rs[1] =  " هلا وغلا 🙈" 

ws[2] = "هلو" -- msg
rs[2] = "هلوات عيوني 🙈❤️" -- reply

ws[3] = "شلونكم" -- msg
rs[3] = "الحمدلله وانت ؟ 🌚🍃" -- reply

ws[4] = "دوم" -- msg 
rs[4] = "يدوم نبضك ❤️🍃" -- reply

ws[5] = "شونك"
rs[5] = "الحمدلله وانته"

ws[6] = "شلونك"
rs[6] = "الحمدلله وانته"

ws[8] = "شغل المبردة"
rs[8] = " تم تشغيل المبردة بنجاح ❄️"

ws[9] = "طفي المبردة"
rs[9] = "لو تموت ماطفيها  😒🍃"

ws[10] = "شغل السبلت"
rs[10] = "🍃 وطنيه ماكو "

ws[11] = "مايا خليفه"
rs[11] = " 😂ها حجي انت هم "

ws[12] = "قناة البوت"
rs[12] = ""

ws[13] = "علوش"
rs[13] = "خير شرايد منه🌚🍃 "

ws[14] = "باركو"
rs[14] = " 😕💔 ها حبي"

ws[15] = "تخليني"
rs[15] = " 😂ادري بيك مدبرها ❤️🐸 "

ws[16] = "زاحف"
rs[16] = "😂🌚امك اشتكلتك مني "

ws[17] = "المبرمجين"
rs[17] = [[

 1.   @barko_b 😻❤️
 
 
                 ┌─────────┐
            ┇ٌٖ بّــะُ้ৡ ﮩ๋͜‏ٖ❁ٱ﴿l﴾ﮩٰٖﮩٰ๋ـ❁رـكوbot
                 └─────────┘
]]
ws[18] = "داعش"
rs[18] = "دي خل يولون 😒❤️"

ws[20] = "سني"
rs[20] = "روحي فداك اخي الشيعي 😒🖐"

ws[21] = "شيعي"
rs[21] = "روحي فداك اخي السني 😕"

ws[22] = "تبادل"
rs[22] = "اهل التبادل تعالو !!"

ws[23] = "العراقين"
rs[23] = "فوديتهم اهلي الغالين 😍🙈"

ws[24] = "من وين"
rs[24] = "😂🔥بيتنه بالعراق عمري عايش هواي وكافي لتزحف "

ws[25] = "هاي"
rs[25] = "هايات 🙈🍷"

ws[26] = "البوت"
rs[26] = "معاجبك ؟ 😕😒🍃"

ws[27] = "البوت واكف"
rs[27] = "دينك مذهبك الجذب  😐"

ws[28] = "منو ديحذف رسائلي"
rs[28] = "ادمنيتك الملطلطين 😐🍃"

ws[29] = "كلاش اوف كلانس"
rs[29] = "تلعبهه ؟ شكد لفلك ؟"

ws[30] = "الحشد الشعبي"
rs[30] = "صكارين الدواعش😌✌❤️"

ws[31] = "ازحف "
rs[31] = " على اختك ازحف 🌚🍃 "

ws[32] = "علي"
rs[32] = " شتريد منه ؟"

ws[33] = "قناة البوت"
rs[33] = "@barko_a"

ws[34] = "جاو"
rs[34] = "يله سد الباب وراك مشغلين سبلت🌝🚶"

ws[35] = "زنوشه"
rs[35] = "فدوه لكلبها حبيبت مطوري الغالي🌹❤️"

ws[36] = "كرار"
rs[36] = "الذيب لاتندك بي لاربك ينسمط 🌝🖕🏿"

ws[40] = "المدرسه"
rs[40] = " 😒🍃 الله لا يراوينه "

ws[41] = "تحبني"
rs[41] = " اعرفك تعرفني 😍🙈😍"

ws[42] = "يعني شكد تحبني"
rs[42] = "اعشقك لتلح  ❤"

ws[43] = "😂"
rs[43] = " دوم حبي ❤️"

ws[44] = "هههه"
rs[44] = " دوم حبي ❤️"

ws[45] = "ههههه"
rs[45] = " دوم حبي ❤️"

ws[46] = "😹"
rs[46] = " دوم حب ❤️"

ws[47] = "🌚"
rs[47] = "   ❤ حبيبي منور ❤"

ws[48] = "😍"
rs[48] = " مح فديتك"

ws[49] = "مح"
rs[49] = " فوديتك❤️"

ws[50] = "انمي"
rs[50] = " اته اوتاكو ؟ ❤️"

ws[51] = "منحرف"
rs[51] = " وينه حطرده 🌚🌚"

ws[52] = "😭"
rs[52] = " 😢😢منو وياك ابني"

ws[53] = "😢"
rs[53] = "  لتبجي 😭😭"

ws[54] = "شكد عمرك"
rs[54] = "زاحفه 😂😂"

ws[55] = "شكد عمرج"
rs[55] = " زاحف 😂"

ws[56] = "اقرالي دعاء"
rs[56] = "هلا بالسديسي"

ws[57] = "غبي"
rs[57] = " انته الاغبى"

ws[58] = "دي"
rs[58] = " خخخخخخخ تف  ❤"

ws[59] = "منو حبيبك"
rs[59] = " اختك 🙈"

ws[60] = "تكرهني"
rs[60] = " يي 😈"

ws[61] = "اكرهك"
rs[61] = " علساس اني احبك تهي بهي 😒🍃"

ws[62] = "😂"
rs[62] = " دوم حبي ❤️"

ws[64] = "الكرادة"
rs[64] = " احسن ناس وربي❤️"

ws[65] = "شارع فلسطين"
rs[65] = " احسن ناس وربي❤️"

ws[66] = "ممكن ملف "
rs[66] = "ارسل كلمه حلم او دريم  😒😒"

ws[67] = "😇"
rs[67] = "  اته مو ملاك اته جهنم بنفسهه 😂"

ws[68] = "😐"
rs[68] = " شبيك صافن 😒🔥"

ws[69] = "رفع ميزه"
rs[69] = "تم اضافة ادمن للمجموعه😒"

ws[70] = "حارة"
rs[70] = "يي كولش 😭🍃🔥"

ws[71] = "خالتك"
rs[71] = " راح اطردك لك 😒"

ws[72] = "اطرد البوت"
rs[72] = "ع اساس اني ميت عليك"

ws[73] = "هه"
rs[73] = " شدتحس"

ws[74] = "شدتحس"
rs[74] = " داحس بيك"

ws[75] = "اكولك"
rs[75] = " يا الله كول 😐😂"

ws[76] = "اكلك"
rs[76] = " احجي  ❤ 😐😂"

ws[78] = "بغداد"
rs[78] = " 😍 فديتهه"

ws[79] = "البصرة"
rs[79] = " احسن ناس وربي❤️"

ws[80] = "barko"
rs[80] = "️ ها حبي "

ws[81] = "يا سورس هذا"
rs[81] = "تلي سيد"

ws[83] = "باي"
rs[83] = " الله وياك/ج ❤️🍃"

ws[84] = "تنح"
rs[84] = "عيب ابني 😒🍃"

ws[85] = "جوعان"
rs[85] = "تعال اكلني 😐😂"

ws[86] = "عطشان"
rs[86] = "روح اشرب مي"

ws[87] = "صايم"
rs[87] = "شسويلك 😐🍃"

ws[88] = "☹️"
rs[88] = "لضوج حبيبي 😢❤️🍃"

ws[89] = "😔"
rs[89] = " ليش الحلو ضايج ❤️🍃"

ws[90] = "بوت"
rs[90] = " ها عيوني 😘"

ws[92] = "كسمك"
rs[92] = " عيب 😱😱😱"

ws[93] = "نعال"
rs[93] = " بوجهك 😐😂"

ws[94] = "حروح اسبح"
rs[94] = " كم ابو الوصخ شعجب ؟ً 😂"

ws[95] = "حروح اغسل"
rs[95] = " واخيراً 😂"

ws[96] = "حروح اطب للحمام"
rs[96] = " واخيراً 😂"

ws[97] = "حبيبتي"
rs[97] = " منو هاي 😱 تخوني 😔☹"

ws[98] = "كبلت"
rs[98] = " عالخير 😂💔"

ws[99] = "البوت عاوي"
rs[99] = " مثل اخلاقك يا صكط  😒"

ws[100] = "منور"
rs[100] = " بنورك حبي 😍🍷"

ws[101] = "حفلش"
rs[101] = " اطلعك جلاليق والحسين"

ws[102] = "كردي"
rs[102] = "والنعم منك ❤️"

ws[103] = "طفي السبلت"
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[104] = "🌝"
rs[104] = "هه"

ws[105] = "اذن المغرب"
rs[105] = "استحرم 🌚🍃"

ws[106] = "حلو"
rs[106] = "انت الاحلى 🌚❤️"

ws[107] = "@Alialhashme"
rs[107] = "هاذا مطوري فديت ربه😘❤️"

ws[115] = " اريد كروب "
rs[115] = " روح على مطوري @barko_b"

ws[116] = "احبك"
rs[116] = "اعشقك مو احبك  ❤ "

ws[117] = "اكو بوت"
rs[117] = "اني شنو هنا طرطور"

ws[118] = "باي"
rs[118] = "الله وياك بحي ❤ ❤"

ws[119] = "ممكن ملف"
rs[119] = "تدلل ارسل بالخاص كلمه حلم او دريم هههههه ❤ "

ws[120] = "السلام عليكم"
rs[120] = "عليكم السلام ورحمة الله وبركاته"

ws[121] = "اكطع"
rs[121] = "اكطع منريد مشاكل  ❤ "

ws[122] = "باركو هايس"
rs[122] = "ها حبي☺️❤️"

ws[125] = "علوش"
rs[125] = "💔😍فديت الصاك مال الكروب"

ws[126] = "باركو جاهز"
rs[126] = "اي جاهز✌😉"

ws[127] = "🤔"
rs[127] = " ها خالو بشنو دتفكر"

ws[129] = "رابط الحذف"
rs[129] = "https://my.telegram.org/auth?to=deactivate الله وياك بحي"

ws[130] = "تعرف فودكا"          
rs[130] = "وهل يخفى القمر ! ❤️🌝"




-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		--send_large_msg ( R , rs[i] );
		--send_reply(msg.id, rs[i])
		reply_msg(msg.id, rs[i], ok_cb, false )
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "Mouamle" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @Mouamle" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end