

do
local function run(msg,matches)
if is_momod(msg) and matches[1]== "الاوامر" then 
local sajody = [[🔴افضل بوت لحماية الكروبات🔴
                  ┌─────────┐
            ┇ٌٖ بّــะُ้ৡ ﮩ๋͜‏ٖ❁ٱ﴿l﴾ﮩٰٖﮩٰ๋ـ❁رـكوbot
                  └─────────┘
🔵️ اوامر استخدام البوت↙️↙️

➖➖➖➖➖➖🔹
☑️ #باي : مغادرة🔚👋
     💂 #admins : الادارين
     👤 #own : المالك
     👥 #admin : الادمنية
     🅱 #bots : البوتات
     ⚠️ #kk :  اطرد
     ⛔️ #block : بلوك عضو
     🚫 #bn : حظر  العضو
     ❌ #bndel : الغاء الحظر
     📃 #bnlist : المحظورين
     🆔 #id : ايدي
     🆔 #in : ايدي برد
     ℹ️ #info : معلومات الكروب
✔️💂 #addadmin : رفع اداري
✖️💂 #remadmin :ازاله اداري
✔️👥 #add : رفع ادمن
✖️👥 #rem : ازاله ادمن
     💬 #snam : اسم المجموعة
     🎇 #spic : ضع صورة للمجموعة
✔️📖 #srules : ضع القوانين
     📖 #rules : القوانين
✔️🔗 #slnk : وضع رابط
✖️🔗 #clnk : رابط جديد
     🔗 #lnk  : الرابط
📥🔗 #linkpriv : الرابط خاص
     🔀️ #spam [5-20] :عدد عدم التكرار
✖️💭️ #del : حذف رسالة في الرد
     🔏️ #sets : الاعدادات
️ فتح و قفل الروابط: 
🔒🔗️ #llnks
🔓🔗️ #unlnks
️ قفل و فتح التكرار:
🔒🔀️ #lspam
🔓🔀️ #unspam
️ فتح وقفل الاضافة:
🔒🚹 #lmem
🔓🚹️ #unmem
️ فتح و قفل الملصقات:
🔒💢 #lstik
🔓💢️ #unstik
 قفل و فتح اضافة البوتات:
🔒🅱 #lbot
🔓🅱 #unbot
 قفل و فتح اعاده التوجيه:
🔒📩 #lfwd
🔓📩 #unfwd
️ كتم - فتح الصمت للعضو:
     🔇  #mut [username]
️ قائمة المكتومين:
🔇📃️ #mutelist
️ حضر وفك الحضر لكلمه معينه:
❌🔤️ #deny
✔️🔤 #allow
 الكلمات الممنوعه:
     📝 #words
 حذف الكلمات الممنوعه:
✖️📝 #delwords
  <<😈اوامر خاصه لمالك الاكروب😈>>
   ️فتح و قفل الفديو:
🔒📹️ #lvid
🔓📹 #unvid
️ فتح و قفل الصوتيات:
🔒🔇️ #laud
🔓🔊 #unaud
️ فتح و قفل الصور المتحركه:
🔒🃏️ #lgif
🔓🃏️ #ungif
️ فتح وقفل الكلايش الطويلة:
🔒📄️ #lsp
🔓📄️ #unsp
️ فتح و قفل المحادثه: 
🔒🔗️ #lall
🔓🔗️ #unall
️ فتح و قفل الصور: 
🔒🔗️ #lpic
🔓🔗️ #unpic
️ فتح و قفل الوسائط: 
🔒🔗️ #ldoc
🔓🔗️ #undoc
️ فتح و قفل النص: 
🔒🔗️ #ltext
🔓🔗️ #untext
  قفل المحادثه ع وقت
🔒🔗️ #muteall [1 : 30]  الوقت
🔓🔗️ #unmuteall
الاعدادات  لهذه الاوامر: 
🔒🔗️️ #mutlist
️ حذف المكتومين:
✖️🔇️ #delmutelist
️ حذف القوانين:
✖️📖️ #delrules
️ حذف المدراء:
✖️👥 #deladmin
➖➖➖➖➖➖ 🔹
آي آستفسآر رآسل آلمطورين📧↙️
💢 Dev = @barko_b

➖➖➖➖➖➖ 🔹
ℹ️ @barko_a :رآبط آلقنآه آلرسميه
🔵 اذا اردت الحصول على اقصى استفاده من البوت يرجى ارسال رساله له في الخاص لفك الحظر للاستفادة من بعض الاوامر التي لا تعمل
مع تحيات فريق عمل {{barko}}

                 ┌─────────┐
              ┇ٌٖ بّــะُ้ৡ ﮩ๋͜‏ٖ❁ٱ﴿l﴾ﮩٰٖﮩٰ๋ـ❁رـكوbot
                 └─────────┘
]]
return reply_msg(msg.id, sajody, ok_cb, false)
end
if not is_momod(msg) then
local sajody = "للمشرفين فقط"
return reply_msg(msg.id, sajody, ok_cb, false)
end
end
return {
patterns ={
  "^#(الاوامر)$"
},
run = run
}
end
